# Replacing Values

In [1]:
import pandas as pd

url = 'https://raw.githubusercontent.com/chrisalbon/simulated_datasets/master/titanic.csv'

df = pd.read_csv(url)
df.head(2)

                           Name PClass   Age     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
1   Allison, Miss Helen Loraine    1st   2.0  female         0        1

In [4]:
df["Sex"].replace("female","woman").sample(5)

92       male
468     woman
355     woman
1094     male
1016     male
Name: Sex, dtype: object

In [5]:
df["Sex"].replace(["female","male"],["woman","man"]).sample(5)

58      woman
1242      man
650       man
1277      man
532     woman
Name: Sex, dtype: object

## We can also find and replace across the entire DataFrame object by specifying the whole data frame instead of a single column:

In [6]:
df.replace(1,"ONE").head(5)

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.0,female,ONE,ONE
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,ONE
2,"Allison, Mr Hudson Joshua Creighton",1st,30.0,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.0,female,0,ONE
4,"Allison, Master Hudson Trevor",1st,0.92,male,ONE,0

In [9]:
df.replace(r"1st","First",regex=True).sample(5) #The 'r' denotes a raw string

,Name,PClass,Age,Sex,Survived,SexCode
56,"Chaffee, Mrs Herbert Fuller (Carrie Constance ...",First,47.0,female,1,1
919,"Kekic, Mr Tido",3rd,NaN,male,0,0
797,"Farrell, Mr James",3rd,NaN,male,0,0
61,"Chibnall (Bowerman), Mrs Edith Martha",First,NaN,female,1,1
579,"Watt, Mrs James (Bessie Inglis Milne)",2nd,40.0,female,1,1

## regex: It checks whether to interpret to_replace and/or value as regular expressions. If it is True, then to_replace must be a string. Otherwise, to_replace must be None because this parameter will be interpreted as a regular expression or a list, dict, or array of regular expressions.

## A Python raw string is a normal string, prefixed with a r or R. This treats characters such as backslash ('\') as a literal character. This also means that this character will not be treated as a escape character.